## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `aws_route53_record.dkim1-notification-canada-ca-us-east-1-CNAME` |
|        | `aws_route53_record.dkim2-notification-canada-ca-us-east-1-CNAME` |
|        | `aws_route53_record.dkim3-notification-canada-ca-us-east-1-CNAME` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.dkim1-notification-canada-ca-us-east-1-CNAME will be created
  + resource "aws_route53_record" "dkim1-notification-canada-ca-us-east-1-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "iymb7ahbsrpfy7ktku4tpibh2n3a2hdk._domainkey.notification.canada.ca"
      + records         = [
          + "iymb7ahbsrpfy7ktku4tpibh2n3a2hdk.dkim.amazonses.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }

  # aws_route53_record.dkim2-notification-canada-ca-us-east-1-CNAME will be created
  + resource "aws_route53_record" "dkim2-notification-canada-ca-us-east-1-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "z7ujljo4n4hbl4slxawnomvstjhlbgx2._domainkey.notification.canada.ca"
      + records         = [
          + "z7ujljo4n4hbl4slxawnomvstjhlbgx2.dkim.amazonses.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }

  # aws_route53_record.dkim3-notification-canada-ca-us-east-1-CNAME will be created
  + resource "aws_route53_record" "dkim3-notification-canada-ca-us-east-1-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "pjmdrlcl2vsjodh4ruc4v2oogw5cs2cl._domainkey.notification.canada.ca"
      + records         = [
          + "pjmdrlcl2vsjodh4ruc4v2oogw5cs2cl.dkim.amazonses.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
